fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Проверяет наличие договора клиента на дату, при его наличии 
// 	заполняет значения сумм абонентской оплаты и стоимости работы за час
//
// Параметры:
// 	СсылкаНаДокумент - Документы.ДоговорыКонтрагентов
// 	ДатаДокумента - Дата
// 	АбонОплата - Число - абонентская оплата в месяц
// 	ОплатаЗаЧас - Число - стоимость часа работ 
// Возвращаемое значение:
//  Булево
//
Функция ВКМ_ЕстьДоговорСТипомАбонентскаяПлатаНаДату(СсылкаНаДоговор, ДатаДокумента, АбонОплата = 0, ОплатаЗаЧас = 0) Экспорт
// ++БелГН ВКМ 05.10.2025
	Результат = Ложь;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка,
		|   ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты,
		|   ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора, ДЕНЬ) <= &ДатаДокумента
		|	И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора, ДЕНЬ) >= &ДатаДокумента
		|	И ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДоговор);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Истина;
		
		АбонОплата = Выборка.ВКМ_СуммаАбонентскойПлаты;
		ОплатаЗаЧас = Выборка.ВКМ_СтоимостьЧасаРаботы;
		
	КонецЕсли;
	
	Возврат Результат;
// --	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
